#include <iostream>
#include <ostream>
#include <iomanip>
#include <conio.h>

#include "Player.h"

using namespace std;

int main()
{
    string name;
    cout << "플레이어 이름을 입력하세요 : ";
    cin >> name;

    Player p(name);

    while (true)
    {
        system("cls");
        int answer;
        cout << "==================================================" << endl;
        cout << " [ " << p.get_name() << " 의 상태 ]" << endl;
        cout << "--------------------------------------------------" << endl;
        cout << "  HP  (생명력) : " << setw(3) << p.get_hp() << " / " << p.get_max_hp() << endl;
        cout << "  ATK (공격력) : " << setw(3) << p.get_atk() << "  |  DEF (방어력) : " << setw(3) << p.get_def() << endl;
        cout << "  SPD (속도)   : " << setw(3) << p.get_spd() << "  |  CRI (치명타) : " << setw(3) << p.get_cri() << "%" <<
            endl;
        cout << "  HIT (명중률) : " << setw(3) << p.get_hit() << "% |  EVA (회피율) : " << setw(3) << p.get_eva() << "%" <<
            endl;
        cout << "--------------------------------------------------" << endl;
        cout << "  보유 재화 : " << 1 << " G" << endl;
        cout << "==================================================" << endl;
        cout << "[ 메인 메뉴 ]" << endl;
        cout << "  1. 보스 도전          2. 트레이닝" << endl;
        cout << "  3. 돈 벌기          0. 게임 종료" << endl;
        cout << "--------------------------------------------------" << endl;
        cout << "  선택 : ";
        cin >> answer;

        if (answer == 1)
        {
            system("cls");
            cout << "==================================================" << endl;
            cout << "             [ 보스 토벌대 - 타겟 선택 ]             " << endl;
            cout << "==================================================" << endl;
            cout << "  현재 스탯 -> ATK: " << 1 << " | HIT: " << 2 << " | SPD: " << 4 << endl;
            cout << "--------------------------------------------------" << endl;
            cout << "  1. [급] 슬라임 킹 (체력 특화) " << endl;
            cout << "     - 설명: 엄청난 맷집을 가졌지만 매우 느립니다." << endl;
            cout << endl;
            cout << "  2. [중] 그림자 암살자 (회피 특화)" << endl;
            cout << "     - 설명: 공격이 거의 맞지 않습니다. 명중률이 필수입니다." << endl;
            cout << endl;
            cout << "  3. [고] 붉은 뇌전 (속도 특화)" << endl;
            cout << "     - 설명: 당신이 숨 쉬기도 전에 먼저 공격합니다." << endl;
            cout << "--------------------------------------------------" << endl;
            cout << "  0. 마을로 돌아가기" << endl;
            cout << "==================================================" << endl;
            cout << "  도전할 보스 번호: ";
        }
        else if (answer == 2)
        {
            while (answer != 0)
            {
                system("cls");
                cout << "==================================================" << endl;
                cout << "             [ 트레이닝 센터 - 신체 연마 ]             " << endl;
                cout << "==================================================" << endl;
                cout << "  현재 보유 골드: " << 0 << " G" << endl;
                cout << "--------------------------------------------------" << endl;
                cout << "  1. 피지컬 훈련 - 효과: HP(생명력) 및 DEF(방어력) 증가" << endl;
                cout << endl;
                cout << "  2. 전술 훈련 - 효과: ATK(공격력) 및 CRI(치명타) 증가" << endl;
                cout << endl;
                cout << "  3. 감각 훈련 - 효과: HIT(명중률) 및 EVA(회피율) 증가" << endl;
                cout << endl;
                cout << "  4. 돌발 훈련 - 효과: SPD(속도) 및 CRI(치명타) 증가" << endl;
                cout << "--------------------------------------------------" << endl;
                cout << "  0. 돌아가기" << endl;
                cout << "==================================================" << endl;
                cout << "  무엇을 훈련하시겠습니까? : ";
                cin >> answer;
            }
        }
        else if (answer == 3)
        {
            system("cls");
            cout << "==================================================" << endl;
            cout << "             [ 저잣거리 - 인력 사무소 ]             " << endl;
            cout << "==================================================" << endl;
            cout << "  현재 보유 재화 : " << 1 << " G" << endl;
            cout << "--------------------------------------------------" << endl;
            cout << "  1. 단순 반복 노가다 (단어 반복 입력)" << endl;
            cout << "     - 지정된 문장을 20회 토씨 하나 틀리지 않고 입력" << endl;
            cout << "     - 집중력이 필요한 단순 노동입니다." << endl;
            cout << endl;
            cout << "  2. 보안 코드 해독 (복잡한 난수 입력)" << endl;
            cout << "     - 대소문자+숫자가 섞인 암호 코드를 5회 입력" << endl;
            cout << "     - 오타 발생 시 보상이 즉시 소멸됩니다." << endl;
            cout << endl;
            cout << "  3. 장부 정리 (긴 숫자 나열 입력)" << endl;
            cout << "     - 10자리 이상의 숫자를 실수 없이 입력" << endl;
            cout << "     - 꼼꼼함이 필수인 사무 노동입니다." << endl;
            cout << "--------------------------------------------------" << endl;
            cout << "  0. 마을로 돌아가기" << endl;
            cout << "==================================================" << endl;
            cout << "  수행할 작업의 번호를 입력하세요 : ";
            cin >> answer;
        }
        else if (answer == 0)
        {
            return 0;
        }
        else
        {
            cout << "다시 입력해주세요" << "\n";
        }
    }
}
